---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderStraightStepsNumberFailure
source: html/55075be6-92a4-7f40-a197-0a27407d124c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderStraightStepsNumberFailure Property

The current layout cannot allow the specified number of treads.
 Increase the length of the run leg in the model or reduce the value for Parallel Treads at Start or Parallel Treads at End.

## Syntax (C#)
```csharp
public static FailureDefinitionId WinderStraightStepsNumberFailure { get; }
```